# Required libraries :

In [17]:
import pandas as pd
import glob, os

<mark>A noter j'ai supprimé les données concernant 2009 car n'a pas la même forme que les autres ( juste pour lire tout en même temps)</mark>

#### Les données sur les caracteristiques :

In [68]:
carac_2005=pd.read_csv('dataset/caracteristiques/caracteristiques_2005.csv',encoding='latin-1')
carac_2005.shape

(87026, 16)

In [69]:
carac_2005.head(2)

,Num_Acc,an,mois,jour,hrmn,lum,agg,int,atm,col,com,adr,gps,lat,long,dep
0,200500000001,5,1,12,1900,3,2,1,1,3,11.0,CD41B,M,5051500.0,294400.0,590
1,200500000002,5,1,21,1600,1,2,1,1,1,51.0,rue de Lille,M,5053700.0,280200.0,590

In [43]:
path =r'dataset/caracteristiques' # use your path
allFiles = glob.glob(path + "/*.csv")
frame = pd.DataFrame()
list_ = []
for file_ in allFiles:
    df = pd.read_csv(file_,encoding='latin-1')
    list_.append(df)
caracteristiques = pd.concat(list_)

In [45]:
caracteristiques.shape

(765576, 16)

##### Les données sur les usagers :

In [48]:
usager_2005=pd.read_csv('dataset/usagers/usagers_2005.csv',encoding='latin-1')
usager_2005.shape

(197498, 12)

In [52]:
usager_2005.head(2)

,Num_Acc,place,catu,grav,sexe,trajet,secu,locp,actp,etatp,an_nais,num_veh
0,200500000001,1,1,4,1,1,11,0,0,0,1976.0,A01
1,200500000001,1,1,3,2,3,11,0,0,0,1968.0,B02

In [44]:
path =r'dataset/usagers' # use your path
allFiles = glob.glob(path + "/*.csv")
frame = pd.DataFrame()
list_ = []
for file_ in allFiles:
    df = pd.read_csv(file_,encoding='latin-1')
    list_.append(df)
usagers = pd.concat(list_)

In [49]:
usagers.shape

(1710043, 12)

In [54]:
usagers.head(2)

,Num_Acc,place,catu,grav,sexe,trajet,secu,locp,actp,etatp,an_nais,num_veh
0,200500000001,1.0,1,4,1,1.0,11.0,0.0,0.0,0.0,1976.0,A01
1,200500000001,1.0,1,3,2,3.0,11.0,0.0,0.0,0.0,1968.0,B02

#### Les données sur les lieux :

In [55]:
lieu_2005=df1=pd.read_csv('dataset/lieux/lieux_2005.csv',encoding='latin-1')
lieu_2005.shape

(87026, 18)

In [56]:
lieu_2005.head(2)

,Num_Acc,catr,voie,v1,v2,circ,nbv,pr,pr1,vosp,prof,plan,lartpc,larrout,surf,infra,situ,env1
0,200500000001,3.0,41.0,0.0,B,2,2,1.0,430.0,0,1,1,0,63,1,0,1,0
1,200500000002,2.0,41.0,0.0,NaN,0,2,0.0,0.0,1,1,1,0,100,1,0,5,0

In [57]:
path =r'dataset/lieux' # use your path
allFiles = glob.glob(path + "/*.csv")
frame = pd.DataFrame()
list_ = []
for file_ in allFiles:
    df = pd.read_csv(file_,encoding='latin-1')
    list_.append(df)
lieux = pd.concat(list_)

C:\Users\pc\Anaconda3\lib\site-packages\IPython\core\interactiveshell.py:2717: DtypeWarning: Columns (2) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [59]:
lieux.head(2)

,Num_Acc,catr,voie,v1,v2,circ,nbv,pr,pr1,vosp,prof,plan,lartpc,larrout,surf,infra,situ,env1
0,200500000001,3.0,41,0.0,B,2.0,2.0,1.0,430.0,0.0,1.0,1.0,0.0,63.0,1.0,0.0,1.0,0.0
1,200500000002,2.0,41,0.0,NaN,0.0,2.0,0.0,0.0,1.0,1.0,1.0,0.0,100.0,1.0,0.0,5.0,0.0

In [60]:
lieux.shape

(765576, 18)

#### Les données sur les vehicules :

In [61]:
vehicules_2005=pd.read_csv('dataset/vehicules/vehicules_2005.csv',encoding='latin-1')
vehicules_2005.shape

(149764, 9)

In [62]:
vehicules_2005.head(2)

        Num_Acc  senc  catv  occutc  obs  obsm  choc  manv num_veh
0  200500000001     0     7       0    0     2     1     1     A01
1  200500000001     0     7       0    0     2     8    10     B02

In [66]:
vehicules_2005.dtypes

Num_Acc     int64
senc        int64
catv        int64
occutc      int64
obs         int64
obsm        int64
choc        int64
manv        int64
num_veh    object
dtype: object

In [63]:
path =r'dataset/vehicules' # use your path
allFiles = glob.glob(path + "/*.csv")
frame = pd.DataFrame()
list_ = []
for file_ in allFiles:
    df = pd.read_csv(file_,encoding='latin-1')
    list_.append(df)
vehicules = pd.concat(list_)

In [64]:
vehicules.shape

(1307042, 9)

In [65]:
vehicules.head(2)

        Num_Acc  senc  catv  occutc  obs  obsm  choc  manv num_veh
0  200500000001   0.0     7       0  0.0   2.0   1.0   1.0     A01
1  200500000001   0.0     7       0  0.0   2.0   8.0  10.0     B02

In [67]:
vehicules.dtypes

Num_Acc      int64
senc       float64
catv         int64
occutc       int64
obs        float64
obsm       float64
choc       float64
manv       float64
num_veh     object
dtype: object

##### Save Data prepared to csv files

In [70]:
#vehicules :
vehicules.to_csv('vehicules_2005-2016.csv')
#lieux
lieux.to_csv('lieux_2005-2016.csv')
#usager :
usagers.to_csv('usager_2005-2016.csv')
#caracteristiques :
caracteristiques.to_csv('caracteristiques_2005-2016.csv')